/*
8. Обработка звука и изображения в двоичных файлах
Программа «вручную» читает волновой звуковой файл (wav)  или растровый файл изображения (bmp), выполняя заданные преобразования звука или изображения. Допускаются ограничения на форматы обрабатываемых файлов (только «моно», 256-цветов и т.п).
1.      Изменение контрастности и яркости изображения.
2.      Уменьшение разрешающей способности путем усреднения групп пикселей (2х2, 3х3).
3.      Искажение изображения («линза», проецирование на сферическую поверхность).
4.      Рисование элементарных графических объектов (линии, окружности, точки).
5.      Амплитудные преобразования звука: сжатие динамического диапазона (компрессия) звука: усиление слабого сигнала по заданной кривой или функции.
6.      Временные преобразования звука: эхо, реверберация.
*/